Revit 2025 API
Grid.Create(Document, Arc) Method
 Creates a new radial grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static Grid Create(
	Document document,
	Arc arc
)
Public Shared Function Create (
	document As Document,
	arc As Arc
) As Grid
public:
static Grid^ Create(
	Document^ document,
	Arc^ arc
)
static member Create :
        document : Document *
        arc : Arc -> Grid
Parameters
document Document
 The document in which the new instance is created.
arc Arc
 An arc object that represents the location of the new grid line.
Return Value
Grid
 The newly created grid line.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The input arc is not on horizontal plane.
ArgumentNullException |  A non-optional argument was null
Remarks
 The arc should be on a horizontal plane.
Example
// Create the geometry arc which the grid locates
XYZ end0 = new XYZ(0, 0, 0);
XYZ end1 = new XYZ(10, 40, 0);
XYZ pointOnCurve = new XYZ(5, 7, 0);
Arc geomArc = Arc.Create(end0, end1, pointOnCurve);
// Create a grid using the geometry arc
Grid arcGrid = Grid.Create(document, geomArc);
if (null == arcGrid)
{
    throw new Exception("Create a new curved grid failed.");
}
// Modify the name of the created grid
arcGrid.Name = "New Name2";
   ' Create the geometry arc which the grid locates
   Dim end0 As New XYZ(0, 0, 0)
   Dim end1 As New XYZ(10, 40, 0)
   Dim pointOnCurve As New XYZ(5, 7, 0)
   Dim geomArc As Arc = Arc.Create(end0, end1, pointOnCurve)
   ' Create a grid using the geometry arc
Dim arcGrid As Grid = Grid.Create(document, geomArc)
   If arcGrid Is Nothing Then
       Throw New Exception("Create a new curved grid failed.")
   End If
   ' Modify the name of the created grid
   arcGrid.Name = "New Name2"
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Grid Class
Create Overload
Autodesk.Revit.DB Namespace